def likes(lst):
    l = len(lst)
    if l == 0:
        return 'Никто не оценил данную запись'
    elif l == 1:
        return f'{lst[0]} оценил(а) данную запись'
    elif l == 2:
        return f'{lst[0]} и {lst[1]} оценили данную запись'
    elif l == 3:
        return f'{lst[0]}, {lst[1]} и {lst[2]} оценили данную запись'
    else:
        return f'{lst[0]}, {lst[1]} и {l - 2} других оценили данную запись'
    return likes
    
    
'''
simple input:

print(likes([]))
print(likes(['Тимур']))
print(likes(['Тимур', 'Артур']))
print(likes(['Тимур', 'Артур', 'Руслан']))
print(likes(['Тимур', 'Артур', 'Руслан', 'Анри']))
print(likes(['Тимур', 'Артур', 'Руслан', 'Анри', 'Дима']))
print(likes(['Тимур', 'Артур', 'Руслан', 'Анри', 'Дима', 'Рома', 'Гвидо', 'Марк']))

simple output:
Никто не оценил данную запись
Тимур оценил(а) данную запись
Тимур и Артур оценили данную запись
Тимур, Артур и Руслан оценили данную запись
Тимур, Артур и 2 других оценили данную запись
Тимур, Артур и 3 других оценили данную запись
Тимур, Артур и 6 других оценили данную запись
'''
